## Pandas 332 List

In [203]:
from typing import List
from typing import Optional

import pandas as pd
import numpy as np

### 176. Second Highest Salary [M]

Write a solution to find the second highest distinct salary from the Employee table.

If there is no second highest salary, return null (return None in Pandas).

In [5]:
data = [[1, 100], [2, 200], [3, 300]]
data = [[1, 100], [2, 200]]

employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

employee

   id  salary
0   1     100
1   2     200

In [25]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    top2 = employee['salary'].drop_duplicates().nlargest(2).sort_values(ascending=False).reset_index(drop=True)
    val = top2[1] if len(top2) >= 2 else None
    return pd.DataFrame({'SecondHighestSalary': [val]})

In [26]:
second_highest_salary(employee)

   SecondHighestSalary
0                  100

### 1757. Recyclable and Low Fat Products [E]

Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

In [29]:
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})
products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [34]:
def find_products(products: pd.DataFrame) -> pd.DataFrame:
    return products.loc[ (products['low_fats']=='Y') & (products['recyclable']=='Y') , :][['product_id']]

In [35]:
find_products(products)

   product_id
1           1
3           3

### 175. Combine Two Tables [E]

Write a solution to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

In [36]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [37]:
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [38]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [41]:
def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(person, address, how='left', on='personId')[['firstName','lastName','city','state']]

    return df

In [42]:
combine_two_tables(person, address)

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

### 181. Employees Earning More Than Their Managers [E]

Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

In [43]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [44]:
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [71]:
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(employee, employee, how='left', left_on='managerId', right_on='id')
    df = df.loc[ df['salary_x'] > df['salary_y'], ['name_x']]
    df.columns = ['Employee']
    return df

In [72]:
find_employees(employee)

  Employee
0      Joe

### 570. Managers with at Least 5 Direct Reports [M]

Write a solution to find managers with at least five direct reports.

Return the result table in any order.

In [73]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [74]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [ ]:
def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    df = employee.groupby(['managerId'], as_index=False).agg(count=('id','count'))
    df = df.loc[ df['count']>= 5]
    df = pd.merge(df, employee, how='inner', left_on='managerId', right_on='id')[['name']]
    # if df.shape[0] == 0:
    #     return pd.DataFrame(columns=['name'])
    return df

In [95]:
find_managers(employee)

   name
0  John

### 197. Rising Temperature [E]

Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

In [104]:
data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

In [105]:
weather

   id recordDate  temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-03           20
3   4 2015-01-04           30

In [118]:
def rising_temperature(weather: pd.DataFrame) -> pd.DataFrame:
    df = weather.copy()
    df['recordDate'] = pd.to_datetime(df['recordDate'])

    df_1 = df.copy()
    df_1['recordDate'] = df['recordDate'] + pd.Timedelta(days=1)

    dfr = pd.merge(df, df_1, how='left', left_on=['recordDate'], right_on=['recordDate'])
    dfr = dfr[ dfr['temperature_x'] > dfr['temperature_y'] ][['id_x']]
    dfr.columns = ['id']

    return dfr

In [119]:
rising_temperature(weather)

   id
1   2
3   4

### 177. Nth Highest Salary [M]

Write a solution to find the nth highest distinct salary from the Employee table. If there are less than n distinct salaries, return null.

In [120]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['Id', 'Salary']).astype({'Id':'Int64', 'Salary':'Int64'})

In [121]:
employee

   Id  Salary
0   1     100
1   2     200
2   3     300

In [198]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    colstr = f'getNthHighestSalary({N})'

    df = employee['Salary'].drop_duplicates().sort_values(ascending=False)
    if (df.shape[0] < N) or (N<1):
        return pd.DataFrame([None],columns=[colstr])

    val = df.head(N).tail(1).reset_index(drop=True)[0]


    df = pd.DataFrame([val], columns=[colstr])
    
    return df

In [199]:
nth_highest_salary(employee, 2)

   getNthHighestSalary(2)
0                     200

### 2877. Create a DataFrame from List [E]

Write a solution to create a DataFrame from a 2D list called student_data. This 2D list contains the IDs and ages of some students.

The DataFrame should have two columns, student_id and age, and be in the same order as the original 2D list.

In [204]:
def createDataframe(student_data: List[List[int]]) -> pd.DataFrame:
    return pd.DataFrame(student_data, columns=['student_id','age'])

In [205]:
student_data = [
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]

createDataframe(student_data)

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

### 180. Consecutive Numbers [M]

Find all numbers that appear at least three times consecutively.

Return the result table in any order.

In [206]:
data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
logs = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

In [207]:
logs

   id  num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

In [ ]:
def consecutive_numbers(logs: pd.DataFrame) -> pd.DataFrame:
    df = logs.copy()
    df['num_1'] = df['num'].diff(1)
    df['num_2'] = df['num'].diff(2)
    df = df.loc[ (df['num_1']==0) & (df['num_2']==0), ['num'] ].drop_duplicates().reset_index(drop=True)
    df.columns = ['ConsecutiveNums']
    return df

In [215]:
consecutive_numbers(logs)

   ConsecutdiveNums
0                 1

### 1148. Article Views I [E]

Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.

In [216]:
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

In [217]:
views

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
1           1          3          6 2019-08-02
2           2          7          7 2019-08-01
3           2          7          6 2019-08-02
4           4          7          1 2019-07-22
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [231]:
def article_views(views: pd.DataFrame) -> pd.DataFrame:
    df = views.loc[ views['author_id'] == views['viewer_id'], ['author_id']].drop_duplicates().sort_values(by=['author_id'], ascending=True).reset_index(drop=True)
    df.columns = ['id']
    return df

In [232]:
article_views(views)

   id
0   4
1   7

### 1193. Monthly Transactions I [M]

Write an SQL query to find for each month and country, the number of transactions and their total amount, the number of approved transactions and their total amount.

Return the result table in any order.

In [233]:
data = [[121, 'US', 'approved', 1000, '2018-12-18'], [122, 'US', 'declined', 2000, '2018-12-19'], [123, 'US', 'approved', 2000, '2019-01-01'], [124, 'DE', 'approved', 2000, '2019-01-07']]
transactions = pd.DataFrame(data, columns=['id', 'country', 'state', 'amount', 'trans_date']).astype({'id':'Int64', 'country':'object', 'state':'object', 'amount':'Int64', 'trans_date':'datetime64[ns]'})

In [234]:
transactions

    id country     state  amount trans_date
0  121      US  approved    1000 2018-12-18
1  122      US  declined    2000 2018-12-19
2  123      US  approved    2000 2019-01-01
3  124      DE  approved    2000 2019-01-07

In [ ]:
def monthly_transactions(transactions: pd.DataFrame) -> pd.DataFrame:
    df = transactions.copy()
    df['month'] = pd.to_datetime(df['trans_date']).dt.strftime('%Y-%m')
    df['amount_approved'] = np.where( df['state']=='approved', df['amount'],0)
    df = df.groupby(['month','country'], as_index=False, dropna=False).agg(
            trans_count=('id','count'),
            approved_count=('state',lambda x: sum(x=='approved')),
            trans_total_amount=('amount','sum'),
            approved_total_amount=('amount_approved','sum')
        )
    return df

In [269]:
monthly_transactions(transactions)

,month,country,trans_count,approved_count,trans_total_amount,approved_total_amount
0,2018-12,US,2,1,3000,1000
1,2019-01,DE,1,1,2000,2000
2,2019-01,US,1,1,2000,2000

### 182. Duplicate Emails [E]

Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

Return the result table in any order.

In [270]:
data = [[1, 'a@b.com'], [2, 'c@d.com'], [3, 'a@b.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'Int64', 'email':'object'})

In [271]:
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [276]:
def duplicate_emails(person: pd.DataFrame) -> pd.DataFrame:
    df = person.groupby(['email'], as_index=False).agg(count=('id','count'))
    df = df.loc[ df['count']>=2, ['email']]
    df.columns = ['Email']
    return df

In [277]:
duplicate_emails(person)

     Email
0  a@b.com

### 595. Big Countries [E]

A country is big if:

* it has an area of at least three million (i.e., 3000000 km2), or

* it has a population of at least twenty-five million (i.e., 25000000).

Write a solution to find the name, population, and area of the big countries.

Return the result table in any order.

In [278]:
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

In [279]:
world

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [285]:
def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    return world.loc[ (world['area']>=3000000) | (world['population']>=25000000), ['name','population','area']]

In [286]:
big_countries(world)

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741